In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4,5,6],'col2':[444,555,666,444,777,888],'col3':['abc','def','ghi','jkl','mnop','xyz']})

In [3]:
# Ex 1:-

df.head()    # Calls the top 5 indexes....

   col1  col2  col3
0     1   444   abc
1     2   555   def
2     3   666   ghi
3     4   444   jkl
4     5   777  mnop

In [4]:
# Ex 2: Finding/returning an array of unique values in a DataFrame..

df['col2'].unique()

array([444, 555, 666, 777, 888], dtype=int64)

In [5]:
# Ex 2ii:- Finding the length of the unique values....

len(df['col2'].unique())      # OR --> df['col2'].nunique()

5

In [6]:
# Ex 2iii:- Finding how many times each unique values occur in that column...

df["col2"].value_counts()

444    2
555    1
666    1
777    1
888    1
Name: col2, dtype: int64

### Selecting Data

In [7]:
df

   col1  col2  col3
0     1   444   abc
1     2   555   def
2     3   666   ghi
3     4   444   jkl
4     5   777  mnop
5     6   888   xyz

In [8]:
# Ex 3:- Using conditional selection to select Data...

df['col2'] > 600

0    False
1    False
2     True
3    False
4     True
5     True
Name: col2, dtype: bool

In [9]:
df[df['col2'] > 600]

   col1  col2  col3
2     3   666   ghi
4     5   777  mnop
5     6   888   xyz

In [10]:
# Ex 3ii:-

df[(df['col2'] > 600) & (df['col1'] < 6)]

   col1  col2  col3
2     3   666   ghi
4     5   777  mnop

### The Apply Method
Examples end at 4iii.

In [11]:
df

   col1  col2  col3
0     1   444   abc
1     2   555   def
2     3   666   ghi
3     4   444   jkl
4     5   777  mnop
5     6   888   xyz

In [12]:
# Ex 4i:- 

def multiply3(y):
    return y*3

df['col1'].apply(multiply3)            # Here y=1,2,3,4,5,6....

0     3
1     6
2     9
3    12
4    15
5    18
Name: col1, dtype: int64

In [13]:
# Ex 4ii:- Getting the length of strings in column 3...

df['col3'].apply(len)

0    3
1    3
2    3
3    3
4    4
5    3
Name: col3, dtype: int64

In [14]:
# 4iii:- Combining apply() w/lambda expressions 
# Making a lambda expression out of multiply3 - See Ex. 4 as reference....

df['col2'].apply(lambda y: y*3)

0    1332
1    1665
2    1998
3    1332
4    2331
5    2664
Name: col2, dtype: int64

In [15]:
# Removing columns - Recall that when removing/dealing w/cols, you must specify "axis=1"....
# Remember to specify "inplace=True" if you want to permanently apply changes...

#  Ex 5:-
df.drop('col1', axis=1)

   col2  col3
0   444   abc
1   555   def
2   666   ghi
3   444   jkl
4   777  mnop
5   888   xyz

In [16]:
# Ex 6:- Returning list of col names...

df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [17]:
# Ex 7:- Returning the index of a table/DataFrame...

df.index

RangeIndex(start=0, stop=6, step=1)

### Sorting a DataFrame

In [18]:
df

   col1  col2  col3
0     1   444   abc
1     2   555   def
2     3   666   ghi
3     4   444   jkl
4     5   777  mnop
5     6   888   xyz

In [19]:
# Ex 8:- Sorting column data...

df.sort_values('col2')                  # Sorts the data in ascending order...

   col1  col2  col3
0     1   444   abc
3     4   444   jkl
1     2   555   def
2     3   666   ghi
4     5   777  mnop
5     6   888   xyz

In [20]:
df.sort_values('col2',ascending=False)      # Sorts the data in descending order...

   col1  col2  col3
5     6   888   xyz
4     5   777  mnop
2     3   666   ghi
1     2   555   def
0     1   444   abc
3     4   444   jkl

In [21]:
# Ex 9:- Finding null values in a DataFrame....

df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False

### Pivot Table

In [22]:
uni_loc = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

In [23]:
df = pd.DataFrame(uni_loc)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [24]:
# Ex 10:-

df.pivot_table(values="D",index=["A","B"],columns=["C"])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN